tutorials/XiFluid/1D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue b 1
    volScalarFieldValue T 300
    volVectorFieldValue U (-1.5 0 0)
);

regions
(
    boxToCell
    {
        box (0 -1 -1) (0.025 1 1);
        fieldValues
        (
            volScalarFieldValue b 0
            volScalarFieldValue T 2000
            volVectorFieldValue U (-10 0 0)
        );
    }
);


// ************************************************************************* //
